tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "superbrothers/zsh-kubectl-prompt"

brew 'go'
brew 'mas'
brew 'kubectl'
brew 'watch'
brew "autojump"
brew "awscli"
brew "dep"
brew "fzf"
brew "helmfile"
brew "kubernetes-helm"
brew "openssl"
brew "postgresql"
brew "python"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "ruby-build"
brew "skaffold"
brew "sqlite"
brew "telnet"
brew "terraform"
brew "tree"
brew "vim"
brew "wget"
brew "nvm"
brew "imagemagick"
brew "kubectx"
brew "kubernetes-cli"
brew "vault"

# cURL-like tool for humans
brew "httpie"

#a command-line JSON processor
brew "jq"

tap 'caskroom/cask'

cask_args appdir: '/Applications'

cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'evernote'
cask 'sourcetree'
cask 'insomnia'
cask 'postico'
cask 'firefox'
cask 'sizeup'
cask 'skype'
cask 'dropbox'
cask 'zoom'
cask 'flux'
cask 'caffeine'
cask 'alfred'
cask 'vagrant'
cask 'google-backup-and-sync'
cask 'google-cloud-sdk'

mas "1Password", id: 443987910
mas "Memory Clean", id: 451444120
